In [1]:
import pandas as pd
import numpy as np
from dateutil import parser
import datetime as dt
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as px

In [2]:
assessments = pd.read_csv("C:/Users/Qwerty/ANALYSIS/my_hub/RFM/assessments.csv")

In [3]:
courses = pd.read_csv("C:/Users/Qwerty/ANALYSIS/my_hub/RFM/courses.csv")

In [5]:
studentAssessment = pd.read_csv("C:/Users/Qwerty/ANALYSIS/my_hub/RFM/studentAssessment.csv")

In [16]:
studentRegistration = pd.read_csv("C:/Users/Qwerty/ANALYSIS/my_hub/RFM/studentRegistration.csv")

# # EDA

In [7]:
assessments.head(3)

  code_module code_presentation  id_assessment assessment_type   date  weight
0         AAA             2013J           1752             TMA   19.0    10.0
1         AAA             2013J           1753             TMA   54.0    20.0
2         AAA             2013J           1754             TMA  117.0    20.0

In [11]:
assessments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206 entries, 0 to 205
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   code_module        206 non-null    object
 1   code_presentation  206 non-null    object
 2   id_assessment      206 non-null    int64
 3   assessment_type    206 non-null    object
 4   date               195 non-null    float64
 5   weight             206 non-null    float64
dtypes: float64(2), int64(1), object(3)
memory usage: 9.8+ KB

In [12]:
assessments.isna().sum()

code_module           0
code_presentation     0
id_assessment         0
assessment_type       0
date                 11
weight                0
dtype: int64

In [8]:
courses.head(3)

  code_module code_presentation  module_presentation_length
0         AAA             2013J                         268
1         AAA             2014J                         269
2         BBB             2013J                         268

In [13]:
courses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 3 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   code_module                 22 non-null     object
 1   code_presentation           22 non-null     object
 2   module_presentation_length  22 non-null     int64
dtypes: int64(1), object(2)
memory usage: 656.0+ bytes

In [9]:
studentAssessment.head(3)

   id_assessment  id_student  date_submitted  is_banked  score
0           1752       11391              18          0   78.0
1           1752       28400              22          0   70.0
2           1752       31604              17          0   72.0

In [14]:
studentAssessment.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173912 entries, 0 to 173911
Data columns (total 5 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id_assessment   173912 non-null  int64
 1   id_student      173912 non-null  int64
 2   date_submitted  173912 non-null  int64
 3   is_banked       173912 non-null  int64
 4   score           173739 non-null  float64
dtypes: float64(1), int64(4)
memory usage: 6.6 MB

In [15]:
studentAssessment.isna().sum()

id_assessment       0
id_student          0
date_submitted      0
is_banked           0
score             173
dtype: int64

In [17]:
studentRegistration.head(3)

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159.0,NaN
1,AAA,2013J,28400,-53.0,NaN
2,AAA,2013J,30268,-92.0,12.0

In [18]:
studentRegistration.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32593 entries, 0 to 32592
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   code_module          32593 non-null  object
 1   code_presentation    32593 non-null  object
 2   id_student           32593 non-null  int64
 3   date_registration    32548 non-null  float64
 4   date_unregistration  10072 non-null  float64
dtypes: float64(2), int64(1), object(2)
memory usage: 1.2+ MB

In [19]:
studentRegistration.isna().sum()

code_module                0
code_presentation          0
id_student                 0
date_registration         45
date_unregistration    22521
dtype: int64

## Analysis

In [20]:
# How many students have successfully completed a course?

In [21]:
# Suppose success >= 40

In [93]:
success_students = studentAssessment.query("score > 39")\
    .merge(assessments.query("assessment_type == 'Exam'").drop_duplicates(),
           on = "id_assessment",
           how = "inner")\
    .groupby("id_student", as_index=False)[["id_assessment"]]\
    .nunique()\
    .rename(columns={"id_assessment":"success_num"})\
    .query("success_num == 1")["id_student"]\
    .count()

print(f"Number of students copleted course: \n{success_students}")

Number of students copleted course:
3802

In [35]:
# The most difficult and easiest exam: 
# courses and exams within the course that have the lowest and highest completion rate.

# completion rate = success exams / total exams

In [66]:
completion_rate = studentAssessment\
    .merge(assessments.query("assessment_type == 'Exam'").drop_duplicates(),
           on = "id_assessment",
           how = "inner")\
    .assign(success = lambda x: (x.score > 39).astype(int))\
    .groupby("id_assessment", as_index=False)\
    .agg({"success":(np.sum, len)})\
    .assign(succsess_rate = lambda row: row.success['sum'] / row.success['len'])\
    .sort_values("succsess_rate", ascending=True)\
    .reset_index(drop=True)

completion_rate

  id_assessment success       succsess_rate
                    sum   len
0         25340     504   602      0.837209
1         24299    1019  1168      0.872432
2         25368     842   950      0.886316
3         24290     664   747      0.888889
4         25354     878   968      0.907025
5         25361     485   524      0.925573

In [89]:
print(f"The most difficult exam: {completion_rate.id_assessment[0]} \n\
The easiest exam: {completion_rate.id_assessment[len(completion_rate.id_assessment) - 1]}")

The most difficult exam: 25340
The easiest exam: 25361

In [96]:
# Average deadline for passing the exams.
# Passing means the last successful passed exam.

In [101]:
deadline = studentAssessment\
    .merge(assessments.query("assessment_type == 'Exam'")[["id_assessment", "code_module"]].drop_duplicates(),
           on = "id_assessment",
           how = "inner")\
    .query("is_banked == 0")\
    .groupby("code_module", as_index=False)\
    .agg({"date_submitted":"mean"})

deadline

  code_module  date_submitted
0         CCC      239.408877
1         DDD      237.901445

In [107]:
print(f"Average deadline:\n\n{deadline}")

Average deadline:

  code_module  date_submitted
0         CCC      239.408877
1         DDD      237.901445

In [108]:
# Top-3 courses by registrations and courses with the biggest churn rate.

In [109]:
studentRegistration.head()

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159.0,NaN
1,AAA,2013J,28400,-53.0,NaN
2,AAA,2013J,30268,-92.0,12.0
3,AAA,2013J,31604,-52.0,NaN
4,AAA,2013J,32885,-176.0,NaN

In [112]:
top_3 = studentRegistration\
    .groupby("code_module", as_index=False)\
    .agg({"id_student":"nunique"})\
    .rename(columns = {"id_student" : "reg_number"})\
    .sort_values("reg_number", ascending=False)\
    .head(3)

top_3

  code_module  reg_number
1         BBB        7692
5         FFF        7397
3         DDD        5848

In [117]:
churn_rate_top3 = studentRegistration[~studentRegistration.date_unregistration.isna()]\
    .groupby("code_module", as_index=False)\
    .agg({"id_student":"nunique"})\
    .rename(columns = {"id_student" : "UNreg_number"})\
    .sort_values("UNreg_number", ascending=False)\
    .head(3)

churn_rate_top3

  code_module  UNreg_number
1         BBB          2314
5         FFF          2249
3         DDD          2065

In [ ]:
# the lowest course completion rate and the longest average course completion time

In [118]:
studentAssessment.head()

   id_assessment  id_student  date_submitted  is_banked  score
0           1752       11391              18          0   78.0
1           1752       28400              22          0   70.0
2           1752       31604              17          0   72.0
3           1752       32885              26          0   69.0
4           1752       38053              19          0   79.0

In [122]:
assessments.assessment_type.unique()

array(['TMA', 'Exam', 'CMA'], dtype=object)

In [147]:
cohort = studentAssessment.query("is_banked == 0")\
    .merge(assessments.query("assessment_type == 'Exam'")[["id_assessment", "code_presentation"]].drop_duplicates(),
          on="id_assessment",
          how = "inner")\
    .assign(success = lambda x: (x.score > 39).astype(int))\
    .assign(success_date_submitted = lambda x: x.success * x.date_submitted)\
    .groupby("code_presentation", as_index=False)\
    .agg({"success":"mean", 
          "success_date_submitted":[lambda x: np.average(x, weights = (x>0))]})

cohort

  code_presentation   success success_date_submitted
                         mean               <lambda>
0             2013B  0.837209             230.164683
1             2013J  0.907025             239.509112
2             2014B  0.904013             232.997389
3             2014J  0.878659             243.680279

In [148]:
cohort.columns = cohort.columns.droplevel(level=1)

In [149]:
cohort

  code_presentation   success  success_date_submitted
0             2013B  0.837209              230.164683
1             2013J  0.907025              239.509112
2             2014B  0.904013              232.997389
3             2014J  0.878659              243.680279

In [150]:
# RFM clusterization

In [151]:
# R is the average time of passed exam, 
# F is the completion rate, 
# M is the average points number  per the exam.

In [170]:
preproc = studentAssessment.query("is_banked == 0")\
    .merge(assessments.query("assessment_type == 'Exam'")[["id_assessment", "code_presentation"]].drop_duplicates(),
          on="id_assessment",
          how = "inner")\
    .assign(success = lambda x: (x.score > 39).astype(int),
           success_date_submitted = lambda x: x.success * x.date_submitted)\
    .groupby("id_student", as_index=False)\
    .agg({
        "success":"mean",
        "success_date_submitted":"mean",
        "score":"mean"})
    
preproc

      id_student  success  success_date_submitted  score
0          23698      1.0                   243.0   80.0
1          24213      1.0                   236.0   58.0
2          27116      1.0                   243.0   96.0
3          28046      1.0                   237.0   40.0
4          28787      1.0                   243.0   44.0
...          ...      ...                     ...    ...
4628     2694886      1.0                   236.0   69.0
4629     2694933      1.0                   230.0   73.0
4630     2695608      1.0                   237.0   73.0
4631     2697181      1.0                   230.0   80.0
4632     2698251      1.0                   234.0   44.0

[4633 rows x 4 columns]

In [171]:
# Create intervals
intervals = {
    "R": list(preproc.success_date_submitted.describe()[3:]),
    "F": list(preproc.success.describe()[3:5]),
    "M": list(preproc.score.describe()[3:])
}

In [177]:
RFM = preproc.assign(
    recency = lambda x: np.digitize(x.success, intervals.get("R")),
    frequency = lambda x: np.digitize(x.success_date_submitted, intervals.get("F")),
    monetary = lambda x: np.digitize(x.score, intervals.get("M")))[["id_student", "recency", "frequency", "monetary"]]

In [178]:
RFM

      id_student  recency  frequency  monetary
0          23698        1          2         3
1          24213        1          2         2
2          27116        1          2         4
3          28046        1          2         1
4          28787        1          2         1
...          ...      ...        ...       ...
4628     2694886        1          2         3
4629     2694933        1          2         3
4630     2695608        1          2         3
4631     2697181        1          2         3
4632     2698251        1          2         1

[4633 rows x 4 columns]